1) /home/pawel/Storage/Projects/infection/error_reproduce/src/UI/Http/Web/Form/User/RegistrationFormType.php:34    [M] TrueValue

--- Original
+++ New
@@ @@
-        return ['minLength' => 8, 'requireLetters' => true, 'requireCaseDiff' => true, 'requireNumbers' => true];
+        return ['minLength' => 8, 'requireLetters' => false, 'requireCaseDiff' => true, 'requireNumbers' => true];

2) /home/pawel/Storage/Projects/infection/error_reproduce/src/UI/Http/Web/Form/User/RegistrationFormType.php:35    [M] TrueValue

--- Original
+++ New
@@ @@
-        return ['minLength' => 8, 'requireLetters' => true, 'requireCaseDiff' => true, 'requireNumbers' => true];
+        return ['minLength' => 8, 'requireLetters' => true, 'requireCaseDiff' => false, 'requireNumbers' => true];

3) /home/pawel/Storage/Projects/infection/error_reproduce/src/UI/Http/Web/Form/User/RegistrationFormType.php:36    [M] TrueValue

--- Original
+++ New
@@ @@
-        return ['minLength' => 8, 'requireLetters' => true, 'requireCaseDiff' => true, 'requireNumbers' => true];
+        return ['minLength' => 8, 'requireLetters' => true, 'requireCaseDiff' => true, 'requireNumbers' => false];
